MikroElektronika/core_packages/PIC/XC8/def/PIC16LF19185/mcu.h
// Register: LCDDATA43
#define LCDDATA43 LCDDATA43
extern volatile unsigned char           LCDDATA43           __at(0x1D43);
#ifndef _LIB_BUILD
asm("LCDDATA43 equ 01D43h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S08C7                  :1;
        unsigned S09C7                  :1;
        unsigned S10C7                  :1;
        unsigned S11C7                  :1;
        unsigned                        :1;
        unsigned S13C7                  :1;
        unsigned S14C7                  :1;
        unsigned S15C7                  :1;
    };
} LCDDATA43bits_t;
extern volatile LCDDATA43bits_t LCDDATA43bits __at(0x1D43);
// bitfield macros
#define _LCDDATA43_S08C7_POSN                               0x0
#define _LCDDATA43_S08C7_POSITION                           0x0
#define _LCDDATA43_S08C7_SIZE                               0x1
#define _LCDDATA43_S08C7_LENGTH                             0x1
#define _LCDDATA43_S08C7_MASK                               0x1
#define _LCDDATA43_S09C7_POSN                               0x1
#define _LCDDATA43_S09C7_POSITION                           0x1
#define _LCDDATA43_S09C7_SIZE                               0x1
#define _LCDDATA43_S09C7_LENGTH                             0x1
#define _LCDDATA43_S09C7_MASK                               0x2
#define _LCDDATA43_S10C7_POSN                               0x2
#define _LCDDATA43_S10C7_POSITION                           0x2
#define _LCDDATA43_S10C7_SIZE                               0x1
#define _LCDDATA43_S10C7_LENGTH                             0x1
#define _LCDDATA43_S10C7_MASK                               0x4
#define _LCDDATA43_S11C7_POSN                               0x3
#define _LCDDATA43_S11C7_POSITION                           0x3
#define _LCDDATA43_S11C7_SIZE                               0x1
#define _LCDDATA43_S11C7_LENGTH                             0x1
#define _LCDDATA43_S11C7_MASK                               0x8
#define _LCDDATA43_S13C7_POSN                               0x5
#define _LCDDATA43_S13C7_POSITION                           0x5
#define _LCDDATA43_S13C7_SIZE                               0x1
#define _LCDDATA43_S13C7_LENGTH                             0x1
#define _LCDDATA43_S13C7_MASK                               0x20
#define _LCDDATA43_S14C7_POSN                               0x6
#define _LCDDATA43_S14C7_POSITION                           0x6
#define _LCDDATA43_S14C7_SIZE                               0x1
#define _LCDDATA43_S14C7_LENGTH                             0x1
#define _LCDDATA43_S14C7_MASK                               0x40
#define _LCDDATA43_S15C7_POSN                               0x7
#define _LCDDATA43_S15C7_POSITION                           0x7
#define _LCDDATA43_S15C7_SIZE                               0x1
#define _LCDDATA43_S15C7_LENGTH                             0x1
#define _LCDDATA43_S15C7_MASK                               0x80

// Register: LCDDATA44
#define LCDDATA44 LCDDATA44
extern volatile unsigned char           LCDDATA44           __at(0x1D44);
#ifndef _LIB_BUILD
asm("LCDDATA44 equ 01D44h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned S18C7                  :1;
        unsigned S19C7                  :1;
        unsigned S20C7                  :1;
        unsigned                        :1;
        unsigned S22C7                  :1;
        unsigned S23C7                  :1;
    };
} LCDDATA44bits_t;
extern volatile LCDDATA44bits_t LCDDATA44bits __at(0x1D44);
// bitfield macros
#define _LCDDATA44_S18C7_POSN                               0x2
#define _LCDDATA44_S18C7_POSITION                           0x2
#define _LCDDATA44_S18C7_SIZE                               0x1
#define _LCDDATA44_S18C7_LENGTH                             0x1
#define _LCDDATA44_S18C7_MASK                               0x4
#define _LCDDATA44_S19C7_POSN                               0x3
#define _LCDDATA44_S19C7_POSITION                           0x3
#define _LCDDATA44_S19C7_SIZE                               0x1
#define _LCDDATA44_S19C7_LENGTH                             0x1
#define _LCDDATA44_S19C7_MASK                               0x8
#define _LCDDATA44_S20C7_POSN                               0x4
#define _LCDDATA44_S20C7_POSITION                           0x4
#define _LCDDATA44_S20C7_SIZE                               0x1
#define _LCDDATA44_S20C7_LENGTH                             0x1
#define _LCDDATA44_S20C7_MASK                               0x10
#define _LCDDATA44_S22C7_POSN                               0x6
#define _LCDDATA44_S22C7_POSITION                           0x6
#define _LCDDATA44_S22C7_SIZE                               0x1
#define _LCDDATA44_S22C7_LENGTH                             0x1
#define _LCDDATA44_S22C7_MASK                               0x40
#define _LCDDATA44_S23C7_POSN                               0x7
#define _LCDDATA44_S23C7_POSITION                           0x7
#define _LCDDATA44_S23C7_SIZE                               0x1
#define _LCDDATA44_S23C7_LENGTH                             0x1
#define _LCDDATA44_S23C7_MASK                               0x80

// Register: LCDDATA45
#define LCDDATA45 LCDDATA45
extern volatile unsigned char           LCDDATA45           __at(0x1D45);
#ifndef _LIB_BUILD
asm("LCDDATA45 equ 01D45h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S24C7                  :1;
        unsigned S25C7                  :1;
        unsigned S26C7                  :1;
        unsigned S27C7                  :1;
        unsigned S28C7                  :1;
        unsigned S29C7                  :1;
        unsigned S30C7                  :1;
        unsigned S31C7                  :1;
    };
} LCDDATA45bits_t;
extern volatile LCDDATA45bits_t LCDDATA45bits __at(0x1D45);
// bitfield macros
#define _LCDDATA45_S24C7_POSN                               0x0
#define _LCDDATA45_S24C7_POSITION                           0x0
#define _LCDDATA45_S24C7_SIZE                               0x1
#define _LCDDATA45_S24C7_LENGTH                             0x1
#define _LCDDATA45_S24C7_MASK                               0x1
#define _LCDDATA45_S25C7_POSN                               0x1
#define _LCDDATA45_S25C7_POSITION                           0x1
#define _LCDDATA45_S25C7_SIZE                               0x1
#define _LCDDATA45_S25C7_LENGTH                             0x1
#define _LCDDATA45_S25C7_MASK                               0x2
#define _LCDDATA45_S26C7_POSN                               0x2
#define _LCDDATA45_S26C7_POSITION                           0x2
#define _LCDDATA45_S26C7_SIZE                               0x1
#define _LCDDATA45_S26C7_LENGTH                             0x1
#define _LCDDATA45_S26C7_MASK                               0x4
#define _LCDDATA45_S27C7_POSN                               0x3
#define _LCDDATA45_S27C7_POSITION                           0x3
#define _LCDDATA45_S27C7_SIZE                               0x1
#define _LCDDATA45_S27C7_LENGTH                             0x1
#define _LCDDATA45_S27C7_MASK                               0x8
#define _LCDDATA45_S28C7_POSN                               0x4
#define _LCDDATA45_S28C7_POSITION                           0x4
#define _LCDDATA45_S28C7_SIZE                               0x1
#define _LCDDATA45_S28C7_LENGTH                             0x1
#define _LCDDATA45_S28C7_MASK                               0x10
#define _LCDDATA45_S29C7_POSN                               0x5
#define _LCDDATA45_S29C7_POSITION                           0x5
#define _LCDDATA45_S29C7_SIZE                               0x1
#define _LCDDATA45_S29C7_LENGTH                             0x1
#define _LCDDATA45_S29C7_MASK                               0x20
#define _LCDDATA45_S30C7_POSN                               0x6
#define _LCDDATA45_S30C7_POSITION                           0x6
#define _LCDDATA45_S30C7_SIZE                               0x1
#define _LCDDATA45_S30C7_LENGTH                             0x1
#define _LCDDATA45_S30C7_MASK                               0x40
#define _LCDDATA45_S31C7_POSN                               0x7
#define _LCDDATA45_S31C7_POSITION                           0x7
#define _LCDDATA45_S31C7_SIZE                               0x1
#define _LCDDATA45_S31C7_LENGTH                             0x1
#define _LCDDATA45_S31C7_MASK                               0x80

// Register: LCDDATA46
#define LCDDATA46 LCDDATA46
extern volatile unsigned char           LCDDATA46           __at(0x1D46);
#ifndef _LIB_BUILD
asm("LCDDATA46 equ 01D46h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S32C7                  :1;
        unsigned S33C7                  :1;
        unsigned S34C7                  :1;
    };
} LCDDATA46bits_t;
extern volatile LCDDATA46bits_t LCDDATA46bits __at(0x1D46);
// bitfield macros
#define _LCDDATA46_S32C7_POSN                               0x0
#define _LCDDATA46_S32C7_POSITION                           0x0
#define _LCDDATA46_S32C7_SIZE                               0x1
#define _LCDDATA46_S32C7_LENGTH                             0x1
#define _LCDDATA46_S32C7_MASK                               0x1
#define _LCDDATA46_S33C7_POSN                               0x1
#define _LCDDATA46_S33C7_POSITION                           0x1
#define _LCDDATA46_S33C7_SIZE                               0x1
#define _LCDDATA46_S33C7_LENGTH                             0x1
#define _LCDDATA46_S33C7_MASK                               0x2
#define _LCDDATA46_S34C7_POSN                               0x2
#define _LCDDATA46_S34C7_POSITION                           0x2
#define _LCDDATA46_S34C7_SIZE                               0x1
#define _LCDDATA46_S34C7_LENGTH                             0x1
#define _LCDDATA46_S34C7_MASK                               0x4

// Register: LCDDATA47
#define LCDDATA47 LCDDATA47
extern volatile unsigned char           LCDDATA47           __at(0x1D47);
#ifndef _LIB_BUILD
asm("LCDDATA47 equ 01D47h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S40C7                  :1;
        unsigned S41C7                  :1;
        unsigned S42C7                  :1;
        unsigned S43C7                  :1;
        unsigned S44C7                  :1;
        unsigned S45C7                  :1;
        unsigned S46C7                  :1;
        unsigned S47C7                  :1;
    };
} LCDDATA47bits_t;
extern volatile LCDDATA47bits_t LCDDATA47bits __at(0x1D47);
// bitfield macros
#define _LCDDATA47_S40C7_POSN                               0x0
#define _LCDDATA47_S40C7_POSITION                           0x0
#define _LCDDATA47_S40C7_SIZE                               0x1
#define _LCDDATA47_S40C7_LENGTH                             0x1
#define _LCDDATA47_S40C7_MASK                               0x1
#define _LCDDATA47_S41C7_POSN                               0x1
#define _LCDDATA47_S41C7_POSITION                           0x1
#define _LCDDATA47_S41C7_SIZE                               0x1
#define _LCDDATA47_S41C7_LENGTH                             0x1
#define _LCDDATA47_S41C7_MASK                               0x2
#define _LCDDATA47_S42C7_POSN                               0x2
#define _LCDDATA47_S42C7_POSITION                           0x2
#define _LCDDATA47_S42C7_SIZE                               0x1
#define _LCDDATA47_S42C7_LENGTH                             0x1
#define _LCDDATA47_S42C7_MASK                               0x4
#define _LCDDATA47_S43C7_POSN                               0x3
#define _LCDDATA47_S43C7_POSITION                           0x3
#define _LCDDATA47_S43C7_SIZE                               0x1
#define _LCDDATA47_S43C7_LENGTH                             0x1
#define _LCDDATA47_S43C7_MASK                               0x8
#define _LCDDATA47_S44C7_POSN                               0x4
#define _LCDDATA47_S44C7_POSITION                           0x4
#define _LCDDATA47_S44C7_SIZE                               0x1
#define _LCDDATA47_S44C7_LENGTH                             0x1
#define _LCDDATA47_S44C7_MASK                               0x10
#define _LCDDATA47_S45C7_POSN                               0x5
#define _LCDDATA47_S45C7_POSITION                           0x5
#define _LCDDATA47_S45C7_SIZE                               0x1
#define _LCDDATA47_S45C7_LENGTH                             0x1
#define _LCDDATA47_S45C7_MASK                               0x20
#define _LCDDATA47_S46C7_POSN                               0x6
#define _LCDDATA47_S46C7_POSITION                           0x6
#define _LCDDATA47_S46C7_SIZE                               0x1
#define _LCDDATA47_S46C7_LENGTH                             0x1
#define _LCDDATA47_S46C7_MASK                               0x40
#define _LCDDATA47_S47C7_POSN                               0x7
#define _LCDDATA47_S47C7_POSITION                           0x7
#define _LCDDATA47_S47C7_SIZE                               0x1
#define _LCDDATA47_S47C7_LENGTH                             0x1
#define _LCDDATA47_S47C7_MASK                               0x80

// Register: CLCDATA
#define CLCDATA CLCDATA
extern volatile unsigned char           CLCDATA             __at(0x1E0F);
#ifndef _LIB_BUILD
asm("CLCDATA equ 01E0Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MLC1OUT                :1;
        unsigned MLC2OUT                :1;
        unsigned MLC3OUT                :1;
        unsigned MLC4OUT                :1;
    };
} CLCDATAbits_t;
extern volatile CLCDATAbits_t CLCDATAbits __at(0x1E0F);
// bitfield macros
#define _CLCDATA_MLC1OUT_POSN                               0x0
#define _CLCDATA_MLC1OUT_POSITION                           0x0
#define _CLCDATA_MLC1OUT_SIZE                               0x1
#define _CLCDATA_MLC1OUT_LENGTH                             0x1
#define _CLCDATA_MLC1OUT_MASK                               0x1
#define _CLCDATA_MLC2OUT_POSN                               0x1
#define _CLCDATA_MLC2OUT_POSITION                           0x1
#define _CLCDATA_MLC2OUT_SIZE                               0x1
#define _CLCDATA_MLC2OUT_LENGTH                             0x1
#define _CLCDATA_MLC2OUT_MASK                               0x2
#define _CLCDATA_MLC3OUT_POSN                               0x2
#define _CLCDATA_MLC3OUT_POSITION                           0x2
#define _CLCDATA_MLC3OUT_SIZE                               0x1
#define _CLCDATA_MLC3OUT_LENGTH                             0x1
#define _CLCDATA_MLC3OUT_MASK                               0x4
#define _CLCDATA_MLC4OUT_POSN                               0x3
#define _CLCDATA_MLC4OUT_POSITION                           0x3
#define _CLCDATA_MLC4OUT_SIZE                               0x1
#define _CLCDATA_MLC4OUT_LENGTH                             0x1
#define _CLCDATA_MLC4OUT_MASK                               0x8

